import pandas as pd


data = {
    'Имя': ['Петр','Павел', 'Виктор', 'Анна', 'Илья', 'Сергей', 'Андрей', 'Ольга', 'Ирина', 'Никита'],
    'Математика': [3, 5, 4, 3, 5, 4, 3, 4, 5, 4],
    'Литература': [4, 5, 4, 3, 4, 5, 3, 4, 5, 4],
    'История': [4, 4, 5, 4, 5, 3, 4, 4, 5, 4],
    'География': [4, 4, 4, 5, 4, 4, 4, 5, 4, 5],
    'Физкультура': [4, 4, 3, 3, 5, 5, 5, 4, 4, 5]

}

df = pd.DataFrame(data)
print(df.head())

print(f'Средняя оценка по математике - {df['Математика'].mean()}')
print(f'Средняя оценка по литературе - {df['Литература'].mean()}')
print(f'Средняя оценка по истории - {df['История'].mean()}')
print(f'Средняя оценка по географии - {df['География'].mean()}')
print(f'Средняя оценка по физкультуре - {df['Физкультура'].mean()}')

print(f'Медианная оценка по математике - {df['Математика'].median()}')
print(f'Медианная оценка по литературе - {df['Литература'].median()}')
print(f'Медианная оценка по истории - {df['История'].median()}')
print(f'Медианная оценка по географии - {df['География'].median()}')
print(f'Медианная оценка по физкультуре - {df['Физкультура'].median()}')


Q1_mat = df['Математика'].quantile(0.25)
Q3_mat = df['Математика'].quantile(0.75)
IQR_mat = Q3_mat - Q1_mat
print(f'Q1_mat = {Q1_mat}, Q3_mat = {Q3_mat}, IQR_mat = {IQR_mat}')

print(f'Стандартное отклонение оценок по математике - {df['Математика'].std()}')
print(f'Стандартное отклонение оценок по литературе - {df['Литература'].std()}')
print(f'Стандартное отклонение оценок по истории - {df['История'].std()}')
print(f'Стандартное отклонение оценок по географии - {df['География'].std()}')
print(f'Стандартное отклонение оценок по физкультуре - {df['Физкультура'].std()}')

